using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Задание_3.Проверка_повторов
{
    internal class Program
    {
        #region Задание 3. Проверка повторов
        //Что нужно сделать
        //Пользователь вводит число. Число сохраняется в HashSet коллекцию.
        //Если такое число уже присутствует в коллекции, то пользователю на экран выводится сообщение, что число уже вводилось ранее.
        //Если числа нет, то появляется сообщение о том, что число успешно сохранено. 

        //Советы и рекомендации
        //Для добавление числа в HashSet используйте метод Add.

        //Стоит ли пользоваться поиском в Сети во время обучения?

        //Однозначно стоит.Одна и та же информация, представленная в разных источниках, усваивается намного лучше, чем если бы вы пользовались только материалами курса.
        //В будущем, когда вы станете самостоятельным разработчиком, поиск в интернете будет занимать большую часть вашей работы.
        //Поэтому важно учиться этому уже сейчас. Обратите внимание на статью Google-oriented programming.

        //Что оценивается
        //В программе в качестве коллекции используется HashSet.
        #endregion
        static void Main(string[] args)
        {
        }
    }
}
